## Plan Result (826: deploy - PlanAndApply)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azuread_access_package.package[&#34;Contributors - dts-sharedservices-demo&#34;]
  * azuread_access_package_assignment_policy.this[&#34;self-approval-with-justification:Contributors - dts-sharedservices-demo&#34;]
  * azuread_access_package_catalog.catalog[&#34;Contributors&#34;]
  * azuread_access_package_catalog_role_assignment.groups[&#34;Contributors&#34;]
  * azuread_access_package_resource_catalog_association.this[&#34;Contributors:DTS Contributors (sub:dts-sharedservices-demo)&#34;]
  * azuread_access_package_resource_package_association.this[&#34;Contributors - dts-sharedservices-demo:Contributors:DTS Contributors (sub:dts-sharedservices-demo)&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_access_package.package["Contributors - dts-sharedservices-demo"] will be created
  + resource "azuread_access_package" "package" {
      + catalog_id   = (known after apply)
      + description  = "Grants contributors access to dts-sharedservices-demo subscription"
      + display_name = "Contributors - dts-sharedservices-demo"
      + hidden       = false
      + id           = (known after apply)
    }

  # azuread_access_package_assignment_policy.this["self-approval-with-justification:Contributors - dts-sharedservices-demo"] will be created
  + resource "azuread_access_package_assignment_policy" "this" {
      + access_package_id = (known after apply)
      + description       = "Initial Policy"
      + display_name      = "Initial Policy"
      + duration_in_days  = 1
      + extension_enabled = true
      + id                = (known after apply)

      + approval_settings {
          + approval_required                = false
          + requestor_justification_required = true
        }

      + question {
          + required = false
          + sequence = 1

          + text {
              + default_text = "Include Jira link in business justification"
            }
        }

      + requestor_settings {
          + requests_accepted = true
          + scope_type        = "SpecificDirectorySubjects"

          + requestor {
              + object_id    = "1cf4a72a-5db7-4992-b43c-e9ea8fd258a7"
              + subject_type = "groupMembers"
            }
        }
    }

  # azuread_access_package_catalog.catalog["Contributors"] will be created
  + resource "azuread_access_package_catalog" "catalog" {
      + description        = "Access to the subscription contributors role"
      + display_name       = "Contributors"
      + externally_visible = false
      + id                 = (known after apply)
      + published          = true
    }

  # azuread_access_package_catalog_role_assignment.groups["Contributors"] will be created
  + resource "azuread_access_package_catalog_role_assignment" "groups" {
      + catalog_id          = (known after apply)
      + id                  = (known after apply)
      + principal_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + role_id             = "ae79f266-94d4-4dab-b730-feca7e132178"
    }

  # azuread_access_package_resource_catalog_association.this["Contributors:DTS Contributors (sub:dts-sharedservices-demo)"] will be created
  + resource "azuread_access_package_resource_catalog_association" "this" {
      + catalog_id             = (known after apply)
      + id                     = (known after apply)
      + resource_origin_id     = "465c8004-c68c-4b9e-8393-52a7771fe7a2"
      + resource_origin_system = "AadGroup"
    }

  # azuread_access_package_resource_package_association.this["Contributors - dts-sharedservices-demo:Contributors:DTS Contributors (sub:dts-sharedservices-demo)"] will be created
  + resource "azuread_access_package_resource_package_association" "this" {
      + access_package_id               = (known after apply)
      + access_type                     = "Member"
      + catalog_resource_association_id = (known after apply)
      + id                              = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":110,"Program":"tfcmt","SHA1":"","Target":"826: deploy - PlanAndApply","Vars":{}} -->